spec/cassettes/Adding_a_credit_card_to_an_organization/as_a_buyer/successfully_adding_a_credit_card.yml

---
http_interactions:
- request:
    method: post
    uri: https://ak-test-2nUrWp1vUFJ9T17cN1sbKBGvue3lZkHmE:@api.balancedpayments.com/v1/customers
    body:
      encoding: UTF-8
      string: '{"name":"Fake Organization","meta":{"entity_id":1,"entity_name":"Fake
        Organization","entity_type":"organization"}}'
    headers:
      User-Agent:
      - balanced-ruby/0.8.2
      Content-Type:
      - application/json
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 201
      message: CREATED
    headers:
      Content-Type:
      - application/json
      Date:
      - Thu, 14 Aug 2014 15:30:54 GMT
      Location:
      - http://bapi-integration-prod-8u30f7.us-west-1.vandelay.io/v1/customers/CU7DVS8gPgojsxukLEUqjon6
      Server:
      - ngx_openresty/1.2.6.3
      X-Balanced-Guru:
      - OHMfb25b62023c711e49cde02a1fe53e539
      X-Balanced-Host:
      - bapi-integration-prod-8u30f7-10-3-5-17
      X-Balanced-Marketplace:
      - TEST-MP4X7mSSQwAyDzwUfc5TAQ7D
      X-Balanced-Merchant:
      - TEST-MR4RZnrOZZQznEBncFS5xnVS
      X-Balanced-Revision:
      - '1.0'
      X-Balanced-Software-Build:
      - 1.8.2
      X-Midlr-Version:
      - '2'
      X-Newrelic-App-Data:
      - PxQFWFNXCQYTUllWAgAAU0YdFhE1AwE2QgNWEVlbQFtcCxYxSBVbDQoZVA4IF0pcXAgEEBhSQhUQXltWEBVNAUIHWRZdGhgSA0kZUR9QClJWBQFRX1IOAgNTV1sCAhtGVQACH0JEBgADAQ9QW14NAFYGX1VSABFORFBWDRUGZQ==
      Content-Length:
      - '1720'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: |-
        {
          "_type": "customer",
          "twitter": null,
          "reversals_uri": "/v1/customers/CU7DVS8gPgojsxukLEUqjon6/reversals",
          "phone": null,
          "meta": {
            "entity_id": "1",
            "entity_name": "Fake Organization",
            "entity_type": "organization"
          },
          "facebook": null,
          "address": {},
          "business_name": null,
          "bank_accounts_uri": "/v1/customers/CU7DVS8gPgojsxukLEUqjon6/bank_accounts",
          "id": "CU7DVS8gPgojsxukLEUqjon6",
          "credits_uri": "/v1/customers/CU7DVS8gPgojsxukLEUqjon6/credits",
          "cards_uri": "/v1/customers/CU7DVS8gPgojsxukLEUqjon6/cards",
          "holds_uri": "/v1/customers/CU7DVS8gPgojsxukLEUqjon6/holds",
          "name": "Fake Organization",
          "refunds_uri": "/v1/customers/CU7DVS8gPgojsxukLEUqjon6/refunds",
          "dob": null,
          "created_at": "2014-08-14T15:30:54.733019Z",
          "destination": null,
          "is_identity_verified": false,
          "uri": "/v1/customers/CU7DVS8gPgojsxukLEUqjon6",
          "source": null,
          "_uris": {
            "transactions_uri": {
              "_type": "page",
              "key": "transactions"
            },
            "bank_accounts_uri": {
              "_type": "page",
              "key": "bank_accounts"
            },
            "refunds_uri": {
              "_type": "page",
              "key": "refunds"
            },
            "debits_uri": {
              "_type": "page",
              "key": "debits"
            },
            "holds_uri": {
              "_type": "page",
              "key": "holds"
            },
            "reversals_uri": {
              "_type": "page",
              "key": "reversals"
            },
            "credits_uri": {
              "_type": "page",
              "key": "credits"
            },
            "cards_uri": {
              "_type": "page",
              "key": "cards"
            }
          },
          "debits_uri": "/v1/customers/CU7DVS8gPgojsxukLEUqjon6/debits",
          "transactions_uri": "/v1/customers/CU7DVS8gPgojsxukLEUqjon6/transactions",
          "ssn_last4": null,
          "email": null,
          "ein": null
        }
    http_version: 
  recorded_at: Thu, 14 Aug 2014 15:30:56 GMT
- request:
    method: get
    uri: https://ak-test-2nUrWp1vUFJ9T17cN1sbKBGvue3lZkHmE:@api.balancedpayments.com/
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - balanced-ruby/0.8.2
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Content-Type:
      - application/json
      Date:
      - Thu, 14 Aug 2014 15:30:55 GMT
      Server:
      - ngx_openresty/1.2.6.3
      X-Balanced-Guru:
      - OHMfb87e95823c711e4b88e02b12035401b
      X-Balanced-Host:
      - bapi-integration-prod-8u30f7-10-3-5-17
      X-Balanced-Marketplace:
      - TEST-MP4X7mSSQwAyDzwUfc5TAQ7D
      X-Balanced-Merchant:
      - TEST-MR4RZnrOZZQznEBncFS5xnVS
      X-Balanced-Revision:
      - '1.1'
      X-Balanced-Software-Build:
      - 1.8.2
      Content-Length:
      - '564'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: |-
        {
          "first_uri": "/?limit=10&offset=0",
          "_type": "page",
          "items": [
            {
              "uri": "/v1"
            }
          ],
          "previous_uri": null,
          "uri": "/?limit=10&offset=0",
          "_uris": {
            "first_uri": {
              "_type": "page",
              "key": "first"
            },
            "next_uri": {
              "_type": "page",
              "key": "next"
            },
            "previous_uri": {
              "_type": "page",
              "key": "previous"
            },
            "last_uri": {
              "_type": "page",
              "key": "last"
            }
          },
          "limit": 10,
          "offset": 0,
          "total": 1,
          "next_uri": null,
          "last_uri": "/?limit=10&offset=0"
        }
    http_version: 
  recorded_at: Thu, 14 Aug 2014 15:30:57 GMT
- request:
    method: get
    uri: https://ak-test-2nUrWp1vUFJ9T17cN1sbKBGvue3lZkHmE:@api.balancedpayments.com/v1/customers/CU7DVS8gPgojsxukLEUqjon6
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - balanced-ruby/0.8.2
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Content-Type:
      - application/json
      Date:
      - Thu, 14 Aug 2014 15:33:59 GMT
      Server:
      - ngx_openresty/1.2.6.3
      X-Balanced-Guru:
      - OHM690d12e623c811e48ad106429171ffad
      X-Balanced-Host:
      - bapi-integration-prod-8u30f7-10-3-4-8
      X-Balanced-Marketplace:
      - TEST-MP4X7mSSQwAyDzwUfc5TAQ7D
      X-Balanced-Merchant:
      - TEST-MR4RZnrOZZQznEBncFS5xnVS
      X-Balanced-Revision:
      - '1.0'
      X-Balanced-Software-Build:
      - 1.8.2
      Content-Length:
      - '494'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: |-
        {
          "_type": "customer",
          "twitter": null,
          "reversals_uri": "/v1/customers/CU7DVS8gPgojsxukLEUqjon6/reversals",
          "phone": null,
          "meta": {
            "entity_id": "1",
            "entity_name": "Fake Organization",
            "entity_type": "organization"
          },
          "facebook": null,
          "address": {},
          "business_name": null,
          "bank_accounts_uri": "/v1/customers/CU7DVS8gPgojsxukLEUqjon6/bank_accounts",
          "id": "CU7DVS8gPgojsxukLEUqjon6",
          "credits_uri": "/v1/customers/CU7DVS8gPgojsxukLEUqjon6/credits",
          "cards_uri": "/v1/customers/CU7DVS8gPgojsxukLEUqjon6/cards",
          "holds_uri": "/v1/customers/CU7DVS8gPgojsxukLEUqjon6/holds",
          "name": "Fake Organization",
          "refunds_uri": "/v1/customers/CU7DVS8gPgojsxukLEUqjon6/refunds",
          "dob": null,
          "created_at": "2014-08-14T15:30:54.733019Z",
          "destination": null,
          "is_identity_verified": false,
          "uri": "/v1/customers/CU7DVS8gPgojsxukLEUqjon6",
          "source": null,
          "_uris": {
            "transactions_uri": {
              "_type": "page",
              "key": "transactions"
            },
            "bank_accounts_uri": {
              "_type": "page",
              "key": "bank_accounts"
            },
            "refunds_uri": {
              "_type": "page",
              "key": "refunds"
            },
            "debits_uri": {
              "_type": "page",
              "key": "debits"
            },
            "holds_uri": {
              "_type": "page",
              "key": "holds"
            },
            "reversals_uri": {
              "_type": "page",
              "key": "reversals"
            },
            "credits_uri": {
              "_type": "page",
              "key": "credits"
            },
            "cards_uri": {
              "_type": "page",
              "key": "cards"
            }
          },
          "debits_uri": "/v1/customers/CU7DVS8gPgojsxukLEUqjon6/debits",
          "transactions_uri": "/v1/customers/CU7DVS8gPgojsxukLEUqjon6/transactions",
          "ssn_last4": null,
          "email": null,
          "ein": null
        }
    http_version: 
  recorded_at: Thu, 14 Aug 2014 15:34:00 GMT
- request:
    method: put
    uri: https://ak-test-2nUrWp1vUFJ9T17cN1sbKBGvue3lZkHmE:@api.balancedpayments.com/v1/customers/CU7DVS8gPgojsxukLEUqjon6
    body:
      encoding: UTF-8
      string: '{"_type":"customer","twitter":null,"reversals_uri":"/v1/customers/CU7DVS8gPgojsxukLEUqjon6/reversals","phone":null,"meta":{"entity_id":"1","entity_name":"Fake
        Organization","entity_type":"organization"},"facebook":null,"address":{},"business_name":null,"bank_accounts_uri":"/v1/customers/CU7DVS8gPgojsxukLEUqjon6/bank_accounts","id":"CU7DVS8gPgojsxukLEUqjon6","credits_uri":"/v1/customers/CU7DVS8gPgojsxukLEUqjon6/credits","cards_uri":"/v1/customers/CU7DVS8gPgojsxukLEUqjon6/cards","holds_uri":"/v1/customers/CU7DVS8gPgojsxukLEUqjon6/holds","name":"Fake
        Organization","refunds_uri":"/v1/customers/CU7DVS8gPgojsxukLEUqjon6/refunds","dob":null,"created_at":"2014-08-14T15:30:54.733019Z","destination":null,"is_identity_verified":false,"source":null,"_uris":{"transactions_uri":{"_type":"page","key":"transactions"},"bank_accounts_uri":{"_type":"page","key":"bank_accounts"},"refunds_uri":{"_type":"page","key":"refunds"},"debits_uri":{"_type":"page","key":"debits"},"holds_uri":{"_type":"page","key":"holds"},"reversals_uri":{"_type":"page","key":"reversals"},"credits_uri":{"_type":"page","key":"credits"},"cards_uri":{"_type":"page","key":"cards"}},"debits_uri":"/v1/customers/CU7DVS8gPgojsxukLEUqjon6/debits","transactions_uri":"/v1/customers/CU7DVS8gPgojsxukLEUqjon6/transactions","ssn_last4":null,"email":null,"ein":null,"card_uri":"/v1/marketplaces/TEST-MP4X7mSSQwAyDzwUfc5TAQ7D/cards/CC3b4KFw8pzvzM7ohGvpjig5"}'
    headers:
      User-Agent:
      - balanced-ruby/0.8.2
      Content-Type:
      - application/json
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Content-Type:
      - application/json
      Date:
      - Thu, 14 Aug 2014 15:33:59 GMT
      Server:
      - ngx_openresty/1.2.6.3
      X-Balanced-Guru:
      - OHM694e80e623c811e4ba9202a1fe52a36c
      X-Balanced-Host:
      - bapi-integration-prod-8u30f7-10-3-5-17
      X-Balanced-Marketplace:
      - TEST-MP4X7mSSQwAyDzwUfc5TAQ7D
      X-Balanced-Merchant:
      - TEST-MR4RZnrOZZQznEBncFS5xnVS
      X-Balanced-Revision:
      - '1.0'
      X-Balanced-Software-Build:
      - 1.8.2
      X-Midlr-Version:
      - '2'
      X-Newrelic-App-Data:
      - PxQFWFNXCQYTUllWAgAAU0YdFhE1AwE2QgNWEVlbQFtcCxYxSBVbDQoZVA4IF0pcXAgEEBhSQhUQXltWEBVNF0AGWRZdGhgSA0kZUR9TAFVTBgJYUlYBBQhSU1UOAhtGVQUHBk5GQQMHVV1RAQFRUFdUXABTAAVASBZRAAoQXW4=
      Content-Length:
      - '545'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: |-
        {
          "_type": "customer",
          "twitter": null,
          "reversals_uri": "/v1/customers/CU7DVS8gPgojsxukLEUqjon6/reversals",
          "phone": null,
          "meta": {
            "entity_id": "1",
            "entity_name": "Fake Organization",
            "entity_type": "organization"
          },
          "facebook": null,
          "address": {
            "country_code": "USA"
          },
          "source_uri": "/v1/customers/CU7DVS8gPgojsxukLEUqjon6/cards/CC3b4KFw8pzvzM7ohGvpjig5",
          "business_name": null,
          "bank_accounts_uri": "/v1/customers/CU7DVS8gPgojsxukLEUqjon6/bank_accounts",
          "id": "CU7DVS8gPgojsxukLEUqjon6",
          "credits_uri": "/v1/customers/CU7DVS8gPgojsxukLEUqjon6/credits",
          "cards_uri": "/v1/customers/CU7DVS8gPgojsxukLEUqjon6/cards",
          "holds_uri": "/v1/customers/CU7DVS8gPgojsxukLEUqjon6/holds",
          "name": "Fake Organization",
          "dob": null,
          "created_at": "2014-08-14T15:30:54.733019Z",
          "destination": null,
          "is_identity_verified": false,
          "uri": "/v1/customers/CU7DVS8gPgojsxukLEUqjon6",
          "refunds_uri": "/v1/customers/CU7DVS8gPgojsxukLEUqjon6/refunds",
          "_uris": {
            "holds_uri": {
              "_type": "page",
              "key": "holds"
            },
            "source_uri": {
              "_type": "card",
              "key": "source"
            },
            "bank_accounts_uri": {
              "_type": "page",
              "key": "bank_accounts"
            },
            "refunds_uri": {
              "_type": "page",
              "key": "refunds"
            },
            "debits_uri": {
              "_type": "page",
              "key": "debits"
            },
            "transactions_uri": {
              "_type": "page",
              "key": "transactions"
            },
            "reversals_uri": {
              "_type": "page",
              "key": "reversals"
            },
            "credits_uri": {
              "_type": "page",
              "key": "credits"
            },
            "cards_uri": {
              "_type": "page",
              "key": "cards"
            }
          },
          "debits_uri": "/v1/customers/CU7DVS8gPgojsxukLEUqjon6/debits",
          "transactions_uri": "/v1/customers/CU7DVS8gPgojsxukLEUqjon6/transactions",
          "ssn_last4": null,
          "email": null,
          "ein": null
        }
    http_version: 
  recorded_at: Thu, 14 Aug 2014 15:34:01 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/customers
    body:
      encoding: US-ASCII
      string: description=Fake%20Organization&metadata[lo.entity_id]=1&metadata[lo.entity_type]=organization
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.21.0
      Authorization:
      - Bearer sk_test_XTLCfIQMwKblsxIF1N4i7y1G
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.21.0","lang":"ruby","lang_version":"2.1.2 p95 (2014-05-08)","platform":"x86_64-darwin13.0","engine":"ruby","publisher":"stripe","uname":"Darwin
        XandersBeatBox.local 13.4.0 Darwin Kernel Version 13.4.0: Wed Dec 17 19:05:52
        PST 2014; root:xnu-2422.115.10~1/RELEASE_X86_64 x86_64","hostname":"XandersBeatBox.local"}'
      Content-Length:
      - '94'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Wed, 13 May 2015 18:59:33 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '912'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_cdgJdHDwyKyTf8mt
      Stripe-Version:
      - '2015-04-07'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "object": "customer",
          "created": 1431543573,
          "id": "cus_6EYBWzx8q0Zq8v",
          "livemode": false,
          "description": "Fake Organization",
          "email": null,
          "delinquent": false,
          "metadata": {
            "lo.entity_id": "1",
            "lo.entity_type": "organization"
          },
          "subscriptions": {
            "object": "list",
            "total_count": 0,
            "has_more": false,
            "url": "/v1/customers/cus_6EYBWzx8q0Zq8v/subscriptions",
            "data": []
          },
          "discount": null,
          "account_balance": 0,
          "currency": null,
          "bank_accounts": {
            "object": "list",
            "total_count": 0,
            "has_more": false,
            "url": "/v1/customers/cus_6EYBWzx8q0Zq8v/bank_accounts",
            "data": []
          },
          "default_bank_account": null,
          "default_source_type": null,
          "sources": {
            "object": "list",
            "total_count": 0,
            "has_more": false,
            "url": "/v1/customers/cus_6EYBWzx8q0Zq8v/sources",
            "data": []
          },
          "default_source": null
        }
    http_version: 
  recorded_at: Wed, 13 May 2015 18:59:33 GMT
- request:
    method: get
    uri: https://api.stripe.com/v1/customers/cus_6EYBWzx8q0Zq8v
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.21.0
      Authorization:
      - Bearer sk_test_XTLCfIQMwKblsxIF1N4i7y1G
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.21.0","lang":"ruby","lang_version":"2.1.2 p95 (2014-05-08)","platform":"x86_64-darwin13.0","engine":"ruby","publisher":"stripe","uname":"Darwin
        XandersBeatBox.local 13.4.0 Darwin Kernel Version 13.4.0: Wed Dec 17 19:05:52
        PST 2014; root:xnu-2422.115.10~1/RELEASE_X86_64 x86_64","hostname":"XandersBeatBox.local"}'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Wed, 13 May 2015 18:59:33 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '912'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_irIMXlB28RBTOhsB
      Stripe-Version:
      - '2015-04-07'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "object": "customer",
          "created": 1431543573,
          "id": "cus_6EYBWzx8q0Zq8v",
          "livemode": false,
          "description": "Fake Organization",
          "email": null,
          "delinquent": false,
          "metadata": {
            "lo.entity_id": "1",
            "lo.entity_type": "organization"
          },
          "subscriptions": {
            "object": "list",
            "total_count": 0,
            "has_more": false,
            "url": "/v1/customers/cus_6EYBWzx8q0Zq8v/subscriptions",
            "data": []
          },
          "discount": null,
          "account_balance": 0,
          "currency": null,
          "bank_accounts": {
            "object": "list",
            "total_count": 0,
            "has_more": false,
            "url": "/v1/customers/cus_6EYBWzx8q0Zq8v/bank_accounts",
            "data": []
          },
          "default_bank_account": null,
          "default_source_type": null,
          "sources": {
            "object": "list",
            "total_count": 0,
            "has_more": false,
            "url": "/v1/customers/cus_6EYBWzx8q0Zq8v/sources",
            "data": []
          },
          "default_source": null
        }
    http_version: 
  recorded_at: Wed, 13 May 2015 18:59:33 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/customers/cus_6EYBWzx8q0Zq8v/sources
    body:
      encoding: US-ASCII
      string: source=tok_16254q2VpjOYk6TmrNnOtVuI
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.21.0
      Authorization:
      - Bearer sk_test_XTLCfIQMwKblsxIF1N4i7y1G
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.21.0","lang":"ruby","lang_version":"2.1.2 p95 (2014-05-08)","platform":"x86_64-darwin13.0","engine":"ruby","publisher":"stripe","uname":"Darwin
        XandersBeatBox.local 13.4.0 Darwin Kernel Version 13.4.0: Wed Dec 17 19:05:52
        PST 2014; root:xnu-2422.115.10~1/RELEASE_X86_64 x86_64","hostname":"XandersBeatBox.local"}'
      Content-Length:
      - '35'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Wed, 13 May 2015 18:59:34 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '553'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_Rh2NcytsOPpq8eGH
      Stripe-Version:
      - '2015-04-07'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "card_16254q2VpjOYk6TmeLU9YN2c",
          "object": "card",
          "last4": "5100",
          "brand": "MasterCard",
          "funding": "prepaid",
          "exp_month": 5,
          "exp_year": 2020,
          "fingerprint": "6xiSYSawDcmtWfRX",
          "country": "US",
          "name": null,
          "address_line1": null,
          "address_line2": null,
          "address_city": null,
          "address_state": null,
          "address_zip": null,
          "address_country": null,
          "cvc_check": "pass",
          "address_line1_check": null,
          "address_zip_check": null,
          "dynamic_last4": null,
          "metadata": {},
          "customer": "cus_6EYBWzx8q0Zq8v"
        }
    http_version: 
  recorded_at: Wed, 13 May 2015 18:59:34 GMT
recorded_with: VCR 2.9.3
